slovar = {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e',
          'ж': 'zh', 'з': 'z', 'и': 'i', 'й': 'i', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
          'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h',
          'ц': 'c', 'ч': 'cz', 'ш': 'sh', 'щ': 'scz', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e',
          'ю': 'u', 'я': 'ja', 'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Е': 'E', 'Ё': 'E',
          'Ж': 'ZH', 'З': 'Z', 'И': 'I', 'Й': 'I', 'К': 'K', 'Л': 'L', 'М': 'M', 'Н': 'N',
          'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T', 'У': 'U', 'Ф': 'F', 'Х': 'H',
          'Ц': 'C', 'Ч': 'CZ', 'Ш': 'SH', 'Щ': 'SCH', 'Ъ': '', 'Ы': 'y', 'Ь': '', 'Э': 'E',
          'Ю': 'U', 'Я': 'YA', ',': '', '?': '', ' ': '_', '~': '', '!': '', '@': '', '#': '',
          '$': '', '%': '', '^': '', '&': '', '*': '', '(': '', ')': '', '-': '', '=': '', '+': '',
          ':': '', ';': '', '<': '', '>': '', '\'': '', '"': '', '\\': '', '/': '', '№': '',
          '[': '', ']': '', '{': '', '}': '', 'ґ': '', 'ї': '', 'є': '', 'Ґ': 'g', 'Ї': 'i',
          'Є': 'e', '—': ''}

slovar_en_ru = {'A': "А", 'I': "И", 'R': "Р", 'O': "О", 'E': "Е"}

marks = [
    ["Зачтено", "З", 1],
    ["Не зачтено", "нз", 2],
    ["Зачтено-удовлетворительно", "З-3", 3],
    ["Зачтено-хорошо", "З-4", 4],
    ["Зачтено-отлично", "З-5", 5],
    ["Сдано", "сд", 8],
    ["Не сдано", "нс", 9],
    ["Не допущен", "нд", 10],
    ["Не явился", "ня", 11],
    ["Неудовлетворительно", "2", 12],
    ["Удовлетворительно", "3", 13],
    ["Хорошо", "4", 14],
    ["Отлично", "5", 15],
    ["Не защитил", "нз", 16],
    ["индивдиуальный план", "ИП", 17],
    ["перезачтено", "перезачтено", 18],
    ["не допущен (деканат)", "нет оценки", 19],
    ["нет оценки", "нет оценки", -1]
]

vedtypes = [
    ["Зач", 1, 2],
    ["ДФЗач", 2, 3, 4, 5],
    ["Экз", 8, 9, 10, 11, 12, 13, 14, 15],
    ["КП", 13, 14, 15, 16],
    ["КР", 13, 14, 15, 16]
]


